# Використовуємо офіційний образ Python як базовий.
FROM python:3.10-slim

# Встановлюємо робочу директорію в контейнері.
WORKDIR /app

# Копіюємо файл залежностей, щоб Docker міг кешувати цей шар.
# Якщо requirements.txt не змінюється, наступний крок не виконуватиметься знову.
COPY requirements.txt .

# Встановлюємо залежності, використовуючи pip.
RUN pip install -r requirements.txt

# Копіюємо решту файлів проєкту в контейнер.
# Цей крок виконується після встановлення залежностей.
COPY . .

# Виставляємо порт, на якому буде працювати застосунок.
EXPOSE 8000

# Задаємо команду, яка буде виконуватися при старті контейнера.
# Використовуємо uvicorn для запуску FastAPI застосунку.
CMD ["python", "main.py"]